In [3]:
import pandas as pd 
df = pd.read_excel('02.xlsx',sheet_name=0) 
df

              姓名         日期  地点         ID号
0       John Doe 2024-08-13  上海  SSD1234567
1     Jane Smith 2024-08-14  北京  SSD1234568
2    Emily Brown 2024-08-16  台北  SSD1234570
3  William Davis 2024-08-17  香港  SSD1234571

In [7]:
# 字典修改
df.rename(columns={'姓名':'Name','日期':'Date','地点':'Place','ID号':'ID'})

            Name       Date Place          ID
0       John Doe 2024-08-13    上海  SSD1234567
1     Jane Smith 2024-08-14    北京  SSD1234568
2    Emily Brown 2024-08-16    台北  SSD1234570
3  William Davis 2024-08-17    香港  SSD1234571

In [8]:
# lambda修改
df.rename(columns=lambda x:x+'列')

             姓名列        日期列 地点列        ID号列
0       John Doe 2024-08-13  上海  SSD1234567
1     Jane Smith 2024-08-14  北京  SSD1234568
2    Emily Brown 2024-08-16  台北  SSD1234570
3  William Davis 2024-08-17  香港  SSD1234571

In [9]:
# 函数方式修改
da = df.rename(columns={'姓名':'Name','日期':'Date','地点':'Place','ID号':'ID'})
da

            Name       Date Place          ID
0       John Doe 2024-08-13    上海  SSD1234567
1     Jane Smith 2024-08-14    北京  SSD1234568
2    Emily Brown 2024-08-16    台北  SSD1234570
3  William Davis 2024-08-17    香港  SSD1234571

In [10]:
da.rename(columns=lambda x:x.upper())

            NAME       DATE PLACE          ID
0       John Doe 2024-08-13    上海  SSD1234567
1     Jane Smith 2024-08-14    北京  SSD1234568
2    Emily Brown 2024-08-16    台北  SSD1234570
3  William Davis 2024-08-17    香港  SSD1234571

In [11]:
# TODO: 添加前缀后缀
df.add_prefix('T__')

           T__姓名      T__日期 T__地点      T__ID号
0       John Doe 2024-08-13    上海  SSD1234567
1     Jane Smith 2024-08-14    北京  SSD1234568
2    Emily Brown 2024-08-16    台北  SSD1234570
3  William Davis 2024-08-17    香港  SSD1234571

In [12]:
df.add_suffix('__T')

           姓名__T      日期__T 地点__T      ID号__T
0       John Doe 2024-08-13    上海  SSD1234567
1     Jane Smith 2024-08-14    北京  SSD1234568
2    Emily Brown 2024-08-16    台北  SSD1234570
3  William Davis 2024-08-17    香港  SSD1234571